server/tags/1.7.18/sql/testdata/soapxml/sendDocuments_v2.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns4="http://x-tee.riik.ee/xsd/xtee.xsd" xmlns:ns5="http://producers.dhl.xtee.riik.ee/producer/dhl" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Header>
		<ns4:asutus xsi:type="xsd:string">70006317</ns4:asutus>
		<ns4:andmekogu xsi:type="xsd:string">dhl</ns4:andmekogu>
		<ns4:isikukood xsi:type="xsd:string">EE38603052255</ns4:isikukood>
		<ns4:id xsi:type="xsd:string">13a213c22e210391131-1095465132</ns4:id>
		<ns4:nimi xsi:type="xsd:string">dhl.sendDocuments.v2</ns4:nimi>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<ns5:sendDocuments SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
			<keha>
				<dokumendid href="cid:vana_kapsel_manus" xsi:nil="true"/>
				<kaust xsi:type="xsd:string"/>
				<sailitustahtaeg>2009-01-25T23:59:59</sailitustahtaeg>
				<edastus_id>123456789_1201</edastus_id>
				<fragment_nr>-1</fragment_nr>
				<fragmente_kokku>0</fragmente_kokku>				
			</keha>
		</ns5:sendDocuments>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>